script/base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
//----------------------------------------------------------------------

6
(
    Top
    {
        type            patch;
        nFaces          3805;
        startFace       1;
    }
    Bottom
    {
        type            patch;
        nFaces          3805;
        startFace       1;
    }

    Left
    {
        type            patch;
        nFaces          837;
        startFace       214105;
    }
    Right
    {
        type            patch;
        nFaces          979;
        startFace       214942;
    }
    Front
    {
        type            patch;
        nFaces          3805;
        startFace       1;
    }
    Back
    {
        type            patch;
        nFaces          3805;
        startFace       1;
    }
)

//----------------------------------------------------------------------
