script/base/constant/turbulenceProperties
//----------------------------- -*- C++ -*- ---------------------------.
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
//----------------------------------------------------------------------

simulationType  laminar;


//----------------------------------------------------------------------
