script/base/constant/transportProperties
//----------------------------- -*- C++ -*- ---------------------------.
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
//----------------------------------------------------------------------


    nu              nu [ 0 2 -1 0 0 0 0 ] 1e-06;



phase1
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1e-06;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
}


phase2
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1e-06;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
}



sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.03;

 theta            theta [ 0 0 0 0 0 0 0 ] 180.; 

//----------------------------------------------------------------------
