script/base/0/U
//----------------------------- -*- C++ -*- ---------------------------.
FoamFile
{
	version 	2.0;
	format  	ascii;
	class   	volVectorField;
	location	"0";
	object  	U;
}
//----------------------------------------------------------------------

dimensions   		[0 1 -1 0 0 0 0];

internalField		uniform (0 0 0);



boundaryField
{
	Back
	{
		type 		fixedValue;
		value		uniform (0 0 0);
	}
	Front
	{
		type 		fixedValue;
		value		uniform (0 0 0);
	}
	Left
	{
		type           		slowTwoPhaseFlux;
		flowRate0       		0;
		flowRate1       		1e-9; 
		gradientFactor0 		0;
		gradientFactor1 		0;
		pdUniformization		0.9;
		pcUniformization		1.;
		value           		uniform (0 0 0);
	}
	Right
	{
         type            inletOutlet;        
         value           $internalField;       
         inletValue      uniform (0 0 0);
	}
	Bottom
	{
		type 		fixedValue;
		value		uniform (0 0 0);
	}
	Top
	{
		type 		fixedValue;
		value		uniform (0 0 0);
	}
	Grainwalls
	{
		type 		fixedValue;
		value		uniform (0 0 0);
	}
}


//---------------------------------------------------------------------'
